## Import
Import **numpy**, **pandas** and **matplotlib**.

In [25]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

## Set the CSV filenames
Set the CSV filenames for **Marinduqe** and **Palawan** dataset.

In [26]:
marinduque_hh_url = "hpq_hh_marinduque.csv"
marinduque_mem_url = "hpq_mem_marinduque.csv"
palawan_hh_url = "hpq_hh_palawan.csv"
palawan_mem_url = "hpq_mem_palawan.csv"

## Reading the Dataset

Reading the **Marinduque** dataset.

In [28]:
marinduque_mem_df = pd.read_csv(marinduque_mem_url, dtype='unicode')
marinduque_mem_df.shape

(204781, 82)

Create a new column called **region** and set it as **Marinduque**. We added this column to distinguish the dataset between the two regions.

In [29]:
marinduque_df = marinduque_mem_df
marinduque_df["region"] = "Marinduque"
marinduque_df.head()

,main.id,memno,nucfam,reln,reln_o,sex,birth_date,age_yr,birth_reg,civstat,...,mocrim,mtheftloc,mrapeloc,minjurloc,mcarnaploc,mcattrustlloc,mocrimloc,mnutind,mnutind_date,region
0,199036,1,1,1,NaN,1,11/6/1960,53,1,2,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Marinduque
1,199036,2,1,2,NaN,2,11/17/1961,52,1,2,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Marinduque
2,199036,3,1,3,NaN,2,3/5/1991,23,1,1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Marinduque
3,199036,4,1,3,NaN,1,4/21/2000,14,1,1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Marinduque
4,199036,5,1,3,NaN,1,4/24/2002,12,1,1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Marinduque

Reading the **Palawan** dataset

In [30]:
palawan_mem_df = pd.read_csv(palawan_mem_url, dtype='unicode')
palawan_mem_df.shape

(459102, 83)

Again, create a new column called **region** and set it as **Palawan**

In [31]:
palawan_df = palawan_mem_df
palawan_df["region"] = "Palawan"
palawan_df.head()

,main.id,memno,nucfam,reln,reln_o,sex,birth_date,age,age_yr,birth_reg,...,mocrim,mtheftloc,mrapeloc,minjurloc,mcarnaploc,mcattrustlloc,mocrimloc,mnutind,mnutind_date,region
0,69279,15,1,1,NaN,1,6/16/1956,57.97399042,57,1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Palawan
1,69279,16,1,2,NaN,2,8/28/1967,46.7761807,46,1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Palawan
2,69279,17,1,3,NaN,2,11/18/1992,21.54962355,21,1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Palawan
3,69279,18,1,3,NaN,1,4/28/1998,16.10951403,16,1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Palawan
4,69279,19,1,3,NaN,1,10/8/2002,11.66324435,11,1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Palawan

In [7]:
all_df = palawan_df.append(marinduque_df, ignore_index=True)
all_df

,main.id,memno,nucfam,reln,reln_o,sex,birth_date,age,age_yr,birth_reg,...,mocrim,mtheftloc,mrapeloc,minjurloc,mcarnaploc,mcattrustlloc,mocrimloc,mnutind,mnutind_date,region
0,69279,15,1,1,NaN,1,6/16/1956,57.97399042,57,1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Palawan
1,69279,16,1,2,NaN,2,8/28/1967,46.7761807,46,1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Palawan
2,69279,17,1,3,NaN,2,11/18/1992,21.54962355,21,1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Palawan
3,69279,18,1,3,NaN,1,4/28/1998,16.10951403,16,1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Palawan
4,69279,19,1,3,NaN,1,10/8/2002,11.66324435,11,1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Palawan
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
663878,2590166,3,1,3,NaN,1,3/20/1995,NaN,20,1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Marinduque
663879,2590166,4,1,3,NaN,1,10/24/1996,NaN,18,1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Marinduque
663880,2590166,5,1,3,NaN,1,12/10/1999,NaN,15,1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Marinduque
663881,2590166,6,1,3,NaN,1,5/16/2002,NaN,13,1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Marinduque
663882,2590166,7,1,3,NaN,1,8/3/2006,NaN,8,1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Marinduque

In [8]:
#all_df = all_df.drop_duplicates()
#all_df = all_df.dropna(axis=1, how='all')

In [23]:
all_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 663883 entries, 0 to 663882
Data columns (total 84 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   main.id              663883 non-null  object
 1   memno                663883 non-null  object
 2   nucfam               663883 non-null  object
 3   reln                 663882 non-null  object
 4   reln_o               3506 non-null    object
 5   sex                  663882 non-null  object
 6   birth_date           663883 non-null  object
 7   age                  459102 non-null  object
 8   age_yr               663883 non-null  int64
 9   birth_reg            663883 non-null  object
 10  civstat              628703 non-null  object
 11  ethgrp               663882 non-null  object
 12  ethgrp_o             41 non-null      object
 13  ofw                  23276 non-null   object
 14  mlenresid            616568 non-null  object
 15  country_resid        7436 non-null    object
 16  country_resid_o      4 non-null       object
 17  prov_resid_code      5510 non-null    object
 18  mun_resid_code       3522 non-null    object
 19  brgy_resid_code      1798 non-null    object
 20  mun_resid_txt        1992 non-null    object
 21  brgy_resid_txt       3689 non-null    object
 22  educind              616430 non-null  object
 23  gradel               233484 non-null  object
 24  sch_type             231962 non-null  object
 25  gradel_calc          663883 non-null  object
 26  ynotsch              294166 non-null  object
 27  ynotsch_o            13151 non-null   object
 28  educal               619678 non-null  float64
 29  psced7               39408 non-null   object
 30  course_o             1 non-null       object
 31  literind             503053 non-null  object
 32  regvotind            421488 non-null  object
 33  voted_last_election  343439 non-null  object
 34  jobind               585970 non-null  object
 35  entrepind            411211 non-null  object
 36  njob                 663882 non-null  object
 37  occup                197612 non-null  object
 38  psoc4                197199 non-null  object
 39  indust               196983 non-null  object
 40  psic4                196901 non-null  object
 41  jstatus              196819 non-null  object
 42  work_ddhrs           663883 non-null  object
 43  work_wkhrs           663882 non-null  object
 44  fadd_work_hrs        196774 non-null  object
 45  fxtra_wrk            196766 non-null  object
 46  workcl               196618 non-null  object
 47  fjob                 237716 non-null  object
 48  first_fjob           9926 non-null    object
 49  jsearch_meth         8498 non-null    object
 50  jsearch_meth_o       250 non-null     object
 51  wks_fjob             663881 non-null  object
 52  ynotlookjob          225815 non-null  object
 53  ynotlookjob_o        5074 non-null    object
 54  lastlookjob          224928 non-null  object
 55  joppind              232619 non-null  object
 56  wtwind               232493 non-null  object
 57  wagcshm              663882 non-null  float64
 58  wagkndm              663882 non-null  object
 59  sss_ind              585946 non-null  object
 60  pregind              13865 non-null   object
 61  solo_parent          44206 non-null   object
 62  pwd_ind              31168 non-null   object
 63  pwd_type             6924 non-null    object
 64  pwd_type_o           2364 non-null    object
 65  pwd_id               6938 non-null    object
 66  scid_ind             52295 non-null   object
 67  mcrimeind            663881 non-null  object
 68  mtheftind            650 non-null     object
 69  mrapeind             555 non-null     object
 70  minjurind            519 non-null     object
 71  mcarnapind           508 non-null     object
 72  mcattrustlind        512 non-null     object
 73  mocrimind            538 non-null     object
 74  mocrim               113 non-null     object
 75  mtheftloc            197 non-null     object
 76  mrapeloc             38 non-null      object
 77  minjurloc            125 non-null     object
 78  mcarnaploc           7 non-null       object
 79  mcattrustlloc        8 non-null       object
 80  mocrimloc            112 non-null     object
 81  mnutind              99514 non-null   object
 82  mnutind_date         99214 non-null   object
 83  region               663883 non-null  object
dtypes: float64(2), int64(1), object(81)
memory usage: 425.5+ MB

In [9]:
all_df["sex"].value_counts()

1            338140
2            325742
7/23/2003         1
Name: sex, dtype: int64

In [10]:
all_df["sex"].unique()

array(['1', '2', '7/23/2003'], dtype=object)

In [11]:
all_df["sex"] = all_df["sex"].map({'1': 'male', '2': 'female'})

In [12]:
all_df["sex"].unique()

array(['male', 'female', nan], dtype=object)

In [13]:
all_df.groupby(["region", "sex"]).size()

region      sex
Marinduque  female    102923
            male      101858
Palawan     female    222819
            male      236282
dtype: int64

In [14]:
all_df["age_yr"].unique()

array(['57', '46', '21', '16', '11', '3', '39', '30', '12', '8', '4',
       '73', '49', '47', '38', '44', '19', '13', '10', '6', '36', '18',
       '48', '35', '33', '15', '14', '7', '1', '43', '50', '9', '52',
       '28', '31', '0', '17', '34', '22', '37', '59', '32', '29', '5',
       '67', '40', '81', '84', '74', '26', '2', '24', '71', '66', '42',
       '20', '69', '41', '51', '85', '60', '27', '56', '89', '80', '61',
       '63', '25', '78', '68', '45', '54', '62', '58', '55', '53', '23',
       '76', '86', '64', '65', '75', '70', '79', '77', '87', '82', '90',
       '72', '88', '92', '83', '94', '91', '95', '102', '98', '104', '99',
       '96', '93', '100', '119', '97', '103', '321', '925', '361', '136',
       '101', '117', '381', '346', '130', '957', '105', '319', '126',
       '129', '113', '953', '238', '125', '355', '325', '121', '148',
       '927', '369', '354', '961', '146', '108'], dtype=object)

In [15]:
all_df['age_yr'] = pd.to_numeric(all_df["age_yr"])
all_df['educal'] = pd.to_numeric(all_df["educal"])
all_df['wagcshm'] = pd.to_numeric(all_df["wagcshm"])

In [16]:
all_df["wagcshm"].value_counts()

0.0          535462
36000.0        7417
24000.0        4926
10000.0        4855
30000.0        4639
              ...
120800.0          1
292654.0          1
73140.0           1
4680000.0         1
65285.0           1
Name: wagcshm, Length: 4584, dtype: int64

In [17]:
all_df["educal"].value_counts()

200.0    68327
0.0      56508
16.0     54654
100.0    45016
14.0     38231
15.0     35072
13.0     34487
300.0    32995
18.0     32090
12.0     29841
19.0     28026
17.0     27006
11.0     24931
20.0     20966
2.0      18638
1.0      17493
32.0     14936
31.0     14859
33.0      8640
210.0     5413
24.0      2980
34.0      2819
23.0      1648
41.0      1489
25.0       735
52.0       554
22.0       390
400.0      347
51.0       266
53.0       146
21.0       140
54.0        35
Name: educal, dtype: int64

In [18]:

over18 = all_df[all_df["age_yr"] >= 18]

In [19]:
over18["educal"].value_counts()

200.0    64169
100.0    41552
16.0     38327
300.0    32929
18.0     19343
14.0     19177
19.0     17612
20.0     17266
15.0     16971
0.0      15541
32.0     14608
13.0     13938
31.0     13085
17.0     11712
12.0      9229
33.0      8555
11.0      5904
210.0     5371
24.0      2913
34.0      2788
23.0      1554
41.0      1472
25.0       659
52.0       475
400.0      346
22.0       322
51.0       156
1.0        132
2.0        127
21.0        92
53.0        78
54.0        34
Name: educal, dtype: int64

In [20]:
over18.shape

(376437, 84)

In [21]:
over18["age_yr"].value_counts()

18     12919
19     12607
20     11857
21     11099
22     10714
       ...
361        1
105        1
325        1
961        1
238        1
Name: age_yr, Length: 115, dtype: int64

In [22]:
over18.groupby("educal").agg({"wagcshm": ["mean", "std", "count"]}).sort_values(("educal"))

              wagcshm
                 mean           std  count
educal
0.0       4541.289428  4.922624e+04  15541
1.0       2209.848485  9.016794e+03    132
2.0       3637.244094  1.198552e+04    127
11.0      5726.861111  1.605530e+04   5904
12.0      7587.869108  7.705408e+04   9229
13.0      8126.582437  2.359801e+04  13938
14.0      8101.655763  2.176223e+04  19177
15.0      8943.844268  2.603275e+04  16971
16.0     11297.798709  6.139421e+04  38327
17.0     11586.819633  3.058264e+04  11712
18.0     13212.730414  3.253159e+04  19343
19.0     13437.910655  4.648745e+04  17612
20.0     17715.051859  6.295671e+04  17266
21.0     16794.163043  4.477378e+04     92
22.0     10128.683230  2.964851e+04    322
23.0     18856.615830  4.347170e+04   1554
24.0     26123.220484  1.978095e+05   2913
25.0     20389.663126  4.620583e+04    659
31.0     13376.636343  6.838951e+04  13085
32.0     19447.958724  1.792320e+05  14608
33.0     35125.817592  1.561853e+06   8555
34.0     73523.048745  2.008547e+06   2788
41.0     37096.922608  2.686873e+05   1472
51.0      6529.589744  2.534922e+04    156
52.0     12908.370526  4.398995e+04    475
53.0     11942.679487  3.711595e+04     78
54.0     20014.117647  3.367459e+04     34
100.0    10478.771690  2.872375e+04  41552
200.0    16286.882799  4.806142e+04  64169
210.0    30620.401988  6.741604e+04   5371
300.0    94192.041072  2.288405e+06  32928
400.0   322173.800578  1.491911e+06    346